Repository: giellalt/corpus-sme
Catalog: prestable/tmx/nob2sme/facta/skuvlahistorja2/pave-s.htm.tmx
Source language: sme
Languages: nob

source: Buoremus vuohki čiehkat gámanjuniid , lea oahppat dárogiela .
nob: Den beste måten å skjule komagen på , er å lære seg norsk .

source: Lean gullan ollu muitalusaid sápmelaččaid birra , geat leat geahččalan fárret eará guovlluide , muhto geaid leat čaibman ja bilkidan , nu ahte leat šaddan fas máhccat ruovttubáikkiidasaset .
nob: Jeg har hørt mange historier om samer som er reist ut , som er blitt flirt av og gjort narr av , slik at de er tvunget til å reise tilbake til sine hjemplasser .

source: Sii , geat dorjot oahpaheaddji Aarsehta , oaivvildit ahte ii leat eará vuohki fuomášahttit olbmuid , go boktit sámiid iešdiđolašvuođa .
nob: De som går inn for lærer Aarseth , mener at det beste botemiddel mot denne uforstand , nettopp ligger i å vekke samenes selvbevissthet .

source: Maiddái orru leamen nu ahte sámegiella ain riibá .
nob: Og det ser også ut som det samiske språk fortsatt holder seg levende .

source: Rønbecka okta vuostálasti skuvlastivrras , celkkii ná : « Badjel čuohtejagi áigi dubmejuvvui sámegiella jápmimii , muhto liikká ain hállat sámegiela .
nob: En av Rønbecks motstandere i skolestyret , uttalte det slik : « Det er over hundre år siden samisk ble dømt til døden , men likevel snakker vi det fremdeles .

source: Vaikko vel Rønbecka oaidnu vuittešge ja sámegiel oahpahus heaittihuvvo skuvllas , de datte mannet máŋga buolvva ovdalgo nagodit jávkadit giela .
nob: Selv om Rønbecks syn skulle seire og samiskundervisningen ble utryddet av skolen , vil det likevel gå mange generasjoner før de klarer å utrydde språket .

source: Jos jo goassege nagodežžet dan dahkat . »
nob: Hvis de noen gang klarer det . »

source: Nággu dáidá joatkašuvvat , sihke oidnosis ja healmmi duohken .
nob: Striden vil sikkert fortsette , både åpent og under overflaten .

source: Danin ii šatta Kárášjoga oahpahusjođiheaddji válljen dušše báikkálaš nággun , muhto mearkan ja láidesteaddjin dasa mo olles min davimus riikkaoassi ovdána .
nob: Derfor blir valget av undervisningsleder ved Karasjok skole ikke bare en lokal feide , men et symptom og en retningsviser for utviklingen i hele vår nordligste landsdel .

source: Eará artihkkalat girjjis Sámi skuvlahistorjá 2
nob: Andre artikler i Samisk skolehistorie 2
